{
    "Filmov": [
        "Filmov is not a Pokemon, but you can catch him everyday at 6pm CST!",
        "Filmov is not a Pokemon but he may turn into a Pokemon if you keep using this command",
        "Filmov evolves to...",
        "Filmov is a digimon",
        "Filmov is not a Pokemon but he lives in a pokeball",
        "Filmov is not a Pokemon but he's on Team Rocket",
        "Filmov is a rare kind of Pokemon usually found on http://twitch.com/filmov",
        "Filmov?! never heard of this Pokemon!",
        "Filmov is not on pokedex database, is it?",
        "Even tho it seems this pokemon is not 12."
    ],
    "mrglowtm": [
        "This is a kind of pokemon whos only form of food is HotPockets",
        "Don't leave any ramen near this pokemon, or it will eat everything.",
        "RAMEN Kappu Kappu Kappu 🍜",
        "GLOWING HOT POCKETS!"
    ],
    "coolfire": [
        "❄️🔥SG",
        "This is a kind of pokemon that have the ability to repel Growlithe",
        "This pokedéx cannot find any Shiny Charmander!",
        "This is a pokemon with strong feelings about murder"
    ],
    "Fantasy_Owl": [
        "Fantasy_Owl evolves into Shiny HootHoot!",
        "This is a very wise kind of pokemon who can tell stories about people dying in unexpected ways...",
        "Did you mean: !dex HootHoot",
        "Fantasy Owl is a secret evolution of Noctowl",
        "This pokemon secretely kill people in a book"
    ],
    "SupuhSel": [
        "This pokemon is very fast, sometimes it can reach speeds of 80 miles per hour!",
        "This pokemon is very kind and generous",
        "This pokemon sometimes needs to be translated to be understood by its own peers"
    ],
    "jupiternova18":[
        "Jupiter favorite planet is Mars",
        "Do you know that you can watch Fairy Tail on Jupiter?",
        "Is Jupiter a pokemon or a planet? I'm not sure",
        "Do they have any pokemons in Jupiter?",
        "Pokedex cannot find any record of pokemons in Jupiter",
        "Pokemon Jupiter is a Pokemon Ruby hack which has been developed since July of 2008."
    ],
    "skinny_meat_yeet":[
        "Did you mean Kimberly Soul?"
    ],
    "MommaMooTwo":[
        "This pokemon is stronger than MewTwo but it also repels Shiny Rayquaza"
    ]
}